Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/birth_family_relationships/before_your_baby_is_born/antenatal_classes.html.txt.tmx
Source language: en
Languages: ga

source: • Time off work and antenatal classes
ga: • Am saor ón obair agus ranganna réamhbheirthe

source: Antenatal classes provide you with information about pregnancy, labour and delivery, and baby care
ga: Tabharfaidh ranganna réamhbheirthe eolas duit faoi thoircheas, luí seoil agus breith, agus cúram naíonán

source: Many of them focus on labour and delivery alone, but others include practical advice on how to care for your baby and adjust to parenthood
ga: Díríonn siad ar luí seoil agus ar an mbreith amháin, ach bíonn comhairle le fáil i gcuid eile acu ar conas aire a thabhairt do do naíonán agus conas dul i dtaithí ar thuismitheoireacht

source: Antenatal classes are provided by your hospital and you will need to telephone them to book your place
ga: Cuireann d'ospidéal ranganna réamhbheirthe ar fáil duit agus bíonn ort glaoch a chur orthu chun d'áit a chur in áirthint

source: Classes are generally offered for expectant mothers alone, or for couples from about 30 weeks
ga: Cuirtear ranganna ar fáil go ginearálta do mháithreacha atá ag súil, nó do lánúnacha ó bhíonn an bhean 30 seachtaine ag súil le leanbh

source: Some hospitals provide classes for couples with special needs
ga: Cuireann roinnt ospidéal ranganna ar fáil do lánúnacha lena mbaineann riachtanais speisialta

source: You will need to contact your local hospital or the Health Service Executive (HSE) for details
ga: Beidh ort dul i dteagmháil leis an ospidéal áitiúil nó Feidhmeannacht na Seirbhíse Sláinte le haghaidh sonraí a fháil

source: You can read more in our document on antenatal visits
ga: Tá tuilleadh faisnéise inár ndoiciméad, Cuairteanna réamhbheirthe

source: Time off work and antenatal classes
ga: Am saor ón obair agus ranganna réamhbheirthe

source: Section 8 of the Maternity Protection (Amendment) Act 2004 allows pregnant women to take paid time off work to attend one set of antenatal classes (other than the last 3 classes in a set)
ga: Faoi Alt 8 den Acht um Chosaint Mháithreachais (Leasú) 2004 is féidir le mná atá torrach am a thógáil saor ón obair le híocaíocht le freastal ar sraith amháin ranganna réamhbhreithe (ach gan an 3 rang deireanach den sraith a bheith san áireamh mar gheall gur iondúil go mbíonn siad ann tar éis don saoire mháithreachais tosnú)

source: For example, if you are attending a set of 8 classes and this is your first pregnancy in employment you are only entitled to be paid while attending 5 of those classes
ga: Níl am saor ón obair le híocaíocht ar fáil duit mar sin le freastal ar ranganna réamhbhreithe gach uair a bhíonn tú torrach agus tú ag obair

source: You do not have the right to paid time off work to attend antenatal classes each time you are pregnant and in employment
ga: Ach, clúdaíonn an ceart sraith amháin ranganna do do chuid toircheas ar fad

source: The entitlement covers one set of classes only
ga: Tá sampla tugtha anseo:

source: If for any reason you are unable to attend some classes due to reasons beyond your control (that is, premature birth, illness, miscarriage or stillbirth) you can carry over your entitlement to paid time off work to attend any untaken classes to your subsequent pregnancies (except the last 3 in a set)
ga: Má tharlaíonn sé, mar shampla, go mbíonn tú tinn agus nach féidir leat freastal ar an 5 rang ar fad an babhta seo, is féidir leat an teidlíocht atá agat a bheith íoctha le freastal ar na ranganna nár éirigh leat freastal orthu a choinneáil d’aon toircheas ina dhiaidh sin

source: Under the Maternity Protection (Time off for Ante–Natal Classes) Regulations 2004 expectant fathers have a once-off right to paid time off work to attend the 2 antenatal classes immediately prior to the birth
ga: Faoi na Rialacháin um Chosaint Mháithreachais 2004 (Am Saor do Ranganna Réamhbhreithe) tá ceart aon uair ag fir a bhfuil páiste leo le teacht ar an saol am saor ón obair a thógáil agus a bheith íoctha air le freastal ar an 2 rang réamhbhreithe díreach roimh an mbreith

source: This entitlement does not extend to every pregnancy while the woman is in employment – it is only a once-off right
ga: Ní féidir an teidlíocht seo a úsáid gach uair a bhíonn toircheas ann nuair atá an bhean fhostaithe - níl ann ach ceart aon uair amháin

source: In order to take this time off work, the employee must notify their employer in writing at least 2 weeks before classes commence, outlining the dates and times of the classes
ga: Más mian le fostaí an t-am saor ón obair seo a thógáil, ní mór dó/dí é a chur in iúl don fhostóir i scríbhinn ar a laghad coicís roimh do na ranganna tosú, ag leagan síos na dátaí agus na hamanna do na ranganna

source: Employers can request written evidence of the classes (dates and times)
ga: Is féidir le fostóirí fianaise i scríbhinn a iarraidh maidir leis na ranganna (dátaí agus amanna)

source: Classes are generally for a number of sessions and topics covered may include:
ga: Ní mhaireann na ranganna ach cúpla seisiún agus ar na topaicí a chlúdaítear bíonn:

source: • Looking after your health during pregnancy
ga: • Ag breathnú i ndiaidh do shláinte le linn toircheasa

source: • Growth and development of the baby during pregnancy
ga: • Fás agus forbairt an naoínáin le linn toircheasa

source: • Options for labour and delivery
ga: • Roghanna maidir le luí seoil agus breith

source: • Pain relief during labour
ga: • Maolú ar phian le linn luí seoil

source: • When to go into hospital
ga: • Cathain is fearr le dul chuig an ospidéil

source: • What to expect during labour
ga: • A mbeaidh tú ag súil leis le linn luí seoil

source: • Breastfeeding support and advice
ga: • Tacaíocht le leanbh a bheathú ar an gcíoch agus comhairle

source: • Emotional aspects of becoming a parent
ga: • Gnéithe mothaítheacha faoi bheith i do thuismitheoir

source: • Physical care of your baby
ga: • Cúram fisiciúil do leanbh

source: • Returning to work/childcare arrangements
ga: • Dul ar ais ag obair/ socruithe cúram leanaí

source: Antenatal classes held by your local public maternity hospital are free of charge
ga: Bionn na ranganna a chuireann d'ospidéal máithreachais áitiúil ar fáil saor in aisce

source: A fee is payable for private classes
ga: Gearrtar táille ar ranganna príobháideacha

source: Check with your maternity hospital for more information
ga: Chun tuilleadh eolais a fháil, cuir ceist ar d'ospidéal máithreachais

source: Your midwife or doctor will probably ask you if you plan to attend an antenatal class at the hospital
ga: Tá gach seans ann go bhfiafróidh do bhean chnáimsí nó do dhochtúir díot an bhfuil sé ar intinn agat freastal a dhéanamh ar rang réamhbheirthe ag an ospidéal

source: These classes are generally busy, so you will need to book early
ga: Bíonn na ranganna seo lán go minic, mar sin beidh ort iad a chur in áirthint go luath

source: You can find contact information for public hospitals here. Where to apply
ga: Is féidir leat teacht ar eolas teagmhála d'ospidéil phoiblí anseo
